grammar/cambridge-grammar1.org
#+OPTIONS: \n:t num:nil html-postamble:nil
* primary grammar
某个单元的页码=(单元数+6)*2
** 93 He speaks English very well (词序1)
*** 93.1
1. Did you watch television all evening?
2. T
3. I like this picture very much.
4. Tom started his new job last week.
5. T
6. Jane bought a present for her friend.
7. I drink three cups of coffee every day.
8. T
9. I borrowed fifty pounds from my brother.
*** 93.2
1. I opened the door slowly.
2. I bought a new computer last week.
3. Paul finished his work quickly.
4. Emily doesn't speak French very well.
5. I did a lot of shopping yesterday.
6. Do you know London well?
7. We enjoyed the party very much.
8. I explained the problem carefully. 
9. We met some friends at the airport.
10. Did you buy that jacket in England?
11. We do the same thing every day.
12. I don't like football very much.
*** 93.3
1. Lisa walks to work every day.
2. I arrived at the hotel early.
3. Julia goes to Italy every year.
4. We have lived here since 1988.
5. Sue was born in London in 1980.
6. Paul didn't go to work yesterday.
7. Helen went to a wedding last weekend.
8. I had my breakfast in bed this morning.
9. Barbara is going to university in September.
10. I saw a beautiful bird in the garden this morning.
11. My parents have been to the United States many times.
12. I left my umbrella in the restaurant last night.
13. Are you going to the cinema tomorrow evening?
14. I took the children to school this morning.
** 94 always/usually/often 等 (词序2)
always/usually/often:通常助动词后和动词前

*** 94.1
1. Paul often plays tennis.
2. He always get up early.
3. He is never late for work.
4. He sometimes gets angry.
5. He rarely goes swimming.
6. He is usually at home in the evening.
*** 94.2
1. My brother never speaks to me.
2. Susan is always polite.
3. I usually finish work at 5 o'clock.
4. Sarah has just started a new job.
5. I rarely go to bed before midnight.
6. The bus isn't usually late.
7. I don't often eat fish.
8. I will never forget what you said.
9. Have you ever lost your passport?
10. Do you still work in the same place?
11. They always stay in the same hotel.
12. Jane doesn't usually work on Saturdays.
13. Is Tina already here?
14. What do you usually have for breakfast?
15. I can never remember his name.
*** 94.3
1. Yes, and I also play tennis.
2. I also speak French.
3. I am also hungry.
4. and I have also been to Ireland.
5. Yes, and I also bought some books.
*** 94.4
1. They both live in London.
	 They both play football.
	 They are both students.
	 They've both got a car.
2. They are all married.
	 They were all born in England.
	 They all live in New York.
** 95 still yet already
still: 依旧
yet: 直到现在,用于(否定和疑问句用于句末)
already: 已经,比预料的早

*** 95.1
1. Do you still play the piano?
2. Do you still live in Clare Street?
3. Are you still a student?
4. Have you still got a motorbike?
5. Do you still go to the cinema a lot?
6. Do you still want to be a teacher?
*** 95.2
1. They were waiting for the bus.
	 They are still waiting.
	 The bus hasn't come yet.
2. He was looking for a job.
	 He is still looking.
	 He hasn't found a job yet.
3. She was asleep.
	 She is still asleep.
	 She hasn't woken up yet.
4. They were having dinner.
	 They are still having dinner.
	 They haven't finished yet.
*** 95.3
1. Are you ready yet?
2. Has Helen come here yet?
3. Have you had your results yet?
4. Have you decided where to go on holiday yet?
*** 95.4
1. He's already
2. has already seen it
3. She has already gone.
4. I have already got one.
5. I have already paid it.
6. already knows

** 97 and but or so because
连词: 连接两个句子,变成一个句子
	- and/but/or
		+ 两个主句主语一致时可以省略掉,和主语
		+ 多个短句并列时,用,且最后用and连接
	- so表结果
	- because后半句不用,,前半句用,
	- 还有多个连词的情况
*** exercises
**** 97.1 
1. I stayed at home and watched television.
2. I bought a newspaper, but I didn't read it.
3. I went to the window and looked out.
4. I wanted to phone you, but I didn't have your number.
5. I jumped into the river and swam to the other side.
6. I usually drive to work, but I went by bus this morning.
7. Do you want me to come with you, or shall I wait here?
**** 97.2 用and/but/so/because
1. It was very hot, so he opened the window.
2. They couldn't play tennis because tennis court is wet.
3. They went to the museum, but it was closed.
4. Bill wasn't hungry, so he didn't have lunch.
5. Helen was late because the traffic is heavy.
6. Sue said goodbye and left.
**** 97.3 and/but写写昨天做的事情
1. In the evening I stayed at home and studied.
2. I went to bed very early because I was tried.
3. I went to school, but it was Sunday yesterday.
4. I feed the cat and played with her.
5. I was tried, so I went to bed very early.
6. I gave my wife a present because it was her birthday yesterday.
