grammar/cambridge-grammar1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-17 Tue 17:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="lenovo" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org95a92ab">primary grammar</a>
<ul>
<li><a href="#orgb1a05e7">93 He speaks English very well (词序1)</a>
<ul>
<li><a href="#orgbd83319">93.1</a></li>
<li><a href="#orga0ec7d8">93.2</a></li>
<li><a href="#org34ac28f">93.3</a></li>
</ul>
</li>
<li><a href="#org21d098d">94 always/usually/often 等 (词序2)</a>
<ul>
<li><a href="#org6c925d2">94.1</a></li>
<li><a href="#orgd2039bf">94.2</a></li>
<li><a href="#orgf97be93">94.3</a></li>
<li><a href="#org0ec8477">94.4</a></li>
</ul>
</li>
<li><a href="#orgda325c8">95 still yet already</a>
<ul>
<li><a href="#org8c8185a">95.1</a></li>
<li><a href="#org871739d">95.2</a></li>
<li><a href="#org193eba6">95.3</a></li>
<li><a href="#org0b73fc7">95.4</a></li>
</ul>
</li>
<li><a href="#org26e05ea">97 and but or so because</a>
<ul>
<li><a href="#org4348cff">exercises</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org95a92ab" class="outline-2">
<h2 id="org95a92ab">primary grammar</h2>
<div class="outline-text-2" id="text-org95a92ab">
<p>
某个单元的页码=(单元数+6)*2<br />
</p>
</div>
<div id="outline-container-orgb1a05e7" class="outline-3">
<h3 id="orgb1a05e7">93 He speaks English very well (词序1)</h3>
<div class="outline-text-3" id="text-orgb1a05e7">
</div>
<div id="outline-container-orgbd83319" class="outline-4">
<h4 id="orgbd83319">93.1</h4>
<div class="outline-text-4" id="text-orgbd83319">
<ol class="org-ol">
<li>Did you watch television all evening?<br /></li>
<li>T<br /></li>
<li>I like this picture very much.<br /></li>
<li>Tom started his new job last week.<br /></li>
<li>T<br /></li>
<li>Jane bought a present for her friend.<br /></li>
<li>I drink three cups of coffee every day.<br /></li>
<li>T<br /></li>
<li>I borrowed fifty pounds from my brother.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orga0ec7d8" class="outline-4">
<h4 id="orga0ec7d8">93.2</h4>
<div class="outline-text-4" id="text-orga0ec7d8">
<ol class="org-ol">
<li>I opened the door slowly.<br /></li>
<li>I bought a new computer last week.<br /></li>
<li>Paul finished his work quickly.<br /></li>
<li>Emily doesn't speak French very well.<br /></li>
<li>I did a lot of shopping yesterday.<br /></li>
<li>Do you know London well?<br /></li>
<li>We enjoyed the party very much.<br /></li>
<li>I explained the problem carefully.<br /></li>
<li>We met some friends at the airport.<br /></li>
<li>Did you buy that jacket in England?<br /></li>
<li>We do the same thing every day.<br /></li>
<li>I don't like football very much.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org34ac28f" class="outline-4">
<h4 id="org34ac28f">93.3</h4>
<div class="outline-text-4" id="text-org34ac28f">
<ol class="org-ol">
<li>Lisa walks to work every day.<br /></li>
<li>I arrived at the hotel early.<br /></li>
<li>Julia goes to Italy every year.<br /></li>
<li>We have lived here since 1988.<br /></li>
<li>Sue was born in London in 1980.<br /></li>
<li>Paul didn't go to work yesterday.<br /></li>
<li>Helen went to a wedding last weekend.<br /></li>
<li>I had my breakfast in bed this morning.<br /></li>
<li>Barbara is going to university in September.<br /></li>
<li>I saw a beautiful bird in the garden this morning.<br /></li>
<li>My parents have been to the United States many times.<br /></li>
<li>I left my umbrella in the restaurant last night.<br /></li>
<li>Are you going to the cinema tomorrow evening?<br /></li>
<li>I took the children to school this morning.<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org21d098d" class="outline-3">
<h3 id="org21d098d">94 always/usually/often 等 (词序2)</h3>
<div class="outline-text-3" id="text-org21d098d">
<p>
always/usually/often:通常助动词后和动词前<br />
</p>
</div>

<div id="outline-container-org6c925d2" class="outline-4">
<h4 id="org6c925d2">94.1</h4>
<div class="outline-text-4" id="text-org6c925d2">
<ol class="org-ol">
<li>Paul often plays tennis.<br /></li>
<li>He always get up early.<br /></li>
<li>He is never late for work.<br /></li>
<li>He sometimes gets angry.<br /></li>
<li>He rarely goes swimming.<br /></li>
<li>He is usually at home in the evening.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgd2039bf" class="outline-4">
<h4 id="orgd2039bf">94.2</h4>
<div class="outline-text-4" id="text-orgd2039bf">
<ol class="org-ol">
<li>My brother never speaks to me.<br /></li>
<li>Susan is always polite.<br /></li>
<li>I usually finish work at 5 o'clock.<br /></li>
<li>Sarah has just started a new job.<br /></li>
<li>I rarely go to bed before midnight.<br /></li>
<li>The bus isn't usually late.<br /></li>
<li>I don't often eat fish.<br /></li>
<li>I will never forget what you said.<br /></li>
<li>Have you ever lost your passport?<br /></li>
<li>Do you still work in the same place?<br /></li>
<li>They always stay in the same hotel.<br /></li>
<li>Jane doesn't usually work on Saturdays.<br /></li>
<li>Is Tina already here?<br /></li>
<li>What do you usually have for breakfast?<br /></li>
<li>I can never remember his name.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-orgf97be93" class="outline-4">
<h4 id="orgf97be93">94.3</h4>
<div class="outline-text-4" id="text-orgf97be93">
<ol class="org-ol">
<li>Yes, and I also play tennis.<br /></li>
<li>I also speak French.<br /></li>
<li>I am also hungry.<br /></li>
<li>and I have also been to Ireland.<br /></li>
<li>Yes, and I also bought some books.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org0ec8477" class="outline-4">
<h4 id="org0ec8477">94.4</h4>
<div class="outline-text-4" id="text-org0ec8477">
<ol class="org-ol">
<li>They both live in London.<br />
They both play football.<br />
They are both students.<br />
They've both got a car.<br /></li>
<li>They are all married.<br />
They were all born in England.<br />
They all live in New York.<br /></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgda325c8" class="outline-3">
<h3 id="orgda325c8">95 still yet already</h3>
<div class="outline-text-3" id="text-orgda325c8">
<p>
still: 依旧<br />
yet: 直到现在,用于(否定和疑问句用于句末)<br />
already: 已经,比预料的早<br />
</p>
</div>

<div id="outline-container-org8c8185a" class="outline-4">
<h4 id="org8c8185a">95.1</h4>
<div class="outline-text-4" id="text-org8c8185a">
<ol class="org-ol">
<li>Do you still play the piano?<br /></li>
<li>Do you still live in Clare Street?<br /></li>
<li>Are you still a student?<br /></li>
<li>Have you still got a motorbike?<br /></li>
<li>Do you still go to the cinema a lot?<br /></li>
<li>Do you still want to be a teacher?<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org871739d" class="outline-4">
<h4 id="org871739d">95.2</h4>
<div class="outline-text-4" id="text-org871739d">
<ol class="org-ol">
<li>They were waiting for the bus.<br />
They are still waiting.<br />
The bus hasn't come yet.<br /></li>
<li>He was looking for a job.<br />
He is still looking.<br />
He hasn't found a job yet.<br /></li>
<li>She was asleep.<br />
She is still asleep.<br />
She hasn't woken up yet.<br /></li>
<li>They were having dinner.<br />
They are still having dinner.<br />
They haven't finished yet.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org193eba6" class="outline-4">
<h4 id="org193eba6">95.3</h4>
<div class="outline-text-4" id="text-org193eba6">
<ol class="org-ol">
<li>Are you ready yet?<br /></li>
<li>Has Helen come here yet?<br /></li>
<li>Have you had your results yet?<br /></li>
<li>Have you decided where to go on holiday yet?<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org0b73fc7" class="outline-4">
<h4 id="org0b73fc7">95.4</h4>
<div class="outline-text-4" id="text-org0b73fc7">
<ol class="org-ol">
<li>He's already<br /></li>
<li>has already seen it<br /></li>
<li>She has already gone.<br /></li>
<li>I have already got one.<br /></li>
<li>I have already paid it.<br /></li>
<li>already knows<br /></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org26e05ea" class="outline-3">
<h3 id="org26e05ea">97 and but or so because</h3>
<div class="outline-text-3" id="text-org26e05ea">
<p>
连词: 连接两个句子,变成一个句子<br />
</p>
<ul class="org-ul">
<li>and/but/or<br />
<ul class="org-ul">
<li>两个主句主语一致时可以省略掉,和主语<br /></li>
<li>多个短句并列时,用,且最后用and连接<br /></li>
</ul></li>
<li>so表结果<br /></li>
<li>because后半句不用,,前半句用,<br /></li>
<li>还有多个连词的情况<br /></li>
</ul>
</div>
<div id="outline-container-org4348cff" class="outline-4">
<h4 id="org4348cff">exercises</h4>
<div class="outline-text-4" id="text-org4348cff">
</div>
<ul class="org-ul">
<li><a id="orge10a331"></a>97.1<br />
<div class="outline-text-5" id="text-orge10a331">
<ol class="org-ol">
<li>I stayed at home and watched television.<br /></li>
<li>I bought a newspaper, but I didn't read it.<br /></li>
<li>I went to the window and looked out.<br /></li>
<li>I wanted to phone you, but I didn't have your number.<br /></li>
<li>I jumped into the river and swam to the other side.<br /></li>
<li>I usually drive to work, but I went by bus this morning.<br /></li>
<li>Do you want me to come with you, or shall I wait here?<br /></li>
</ol>
</div>
</li>
<li><a id="org2f8b5c2"></a>97.2 用and/but/so/because<br />
<div class="outline-text-5" id="text-org2f8b5c2">
<ol class="org-ol">
<li>It was very hot, so he opened the window.<br /></li>
<li>They couldn't play tennis because tennis court is wet.<br /></li>
<li>They went to the museum, but it was closed.<br /></li>
<li>Bill wasn't hungry, so he didn't have lunch.<br /></li>
<li>Helen was late because the traffic is heavy.<br /></li>
<li>Sue said goodbye and left.<br /></li>
</ol>
</div>
</li>
<li><a id="org6c34d87"></a>97.3 and/but写写昨天做的事情<br />
<div class="outline-text-5" id="text-org6c34d87">
<ol class="org-ol">
<li>In the evening I stayed at home and studied.<br /></li>
<li>I went to bed very early because I was tried.<br /></li>
<li>I went to school, but it was Sunday yesterday.<br /></li>
<li>I feed the cat and played with her.<br /></li>
<li>I was tried, so I went to bed very early.<br /></li>
<li>I gave my wife a present because it was her birthday yesterday.<br /></li>
</ol>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
